privacy/app/Exports/Listproduk1Export.php

    public function view(): View {
        // getting data from Produk table
        $data = Produk::on($this->connection())->orderBy('id')->get();
---
select * from `produk` order by `id` asc