privacy/app/Exports/Monthly1Export.php

select * from `produk` where `produk`.`id` in ('275')
---
    public function view(): View {

        // check if the lokasi is not 'SEMUA'
        if($this->lokasi != 'SEMUA'){
            // check if show is 'Monthly'

            if($this->show == 'Monthly'){
                // getting data from tb_item_bulanan
                $data = tb_item_bulanan::on($this->connection())->with('produk')->whereBetween('periode', [$this->tanggal_awal, $this->tanggal_akhir])->where('kode_produk', $this->kode_produk)->where('kode_lokasi', auth()->user()->kode_lokasi)->orderBy('periode', 'asc')->get();
                return view('/admin/produk1/monthlyexcel', [
                    'data' => $data,
                    'nama_produk' => $this->get_nama_produk,
                    'pemakaian' => $this->pemakaian,
                    'penerimaan' => $this->penerimaan,
                    'penjualan' => $this->penjualan,
                    'adjustment' => $this->adjustment,
                    'opname' => $this->opname,
                    'transferin' => $this->transferin,
                    'transferout' => $this->transferout,
                    'returbeli' => $this->returbeli,
                    'returjual' => $this->returjual,
                    'disassembling' => $this->disassembling,
                    'assembling' => $this->assembling,
                    'semua' => $this->semua,
                    'lokasi' =>$this->lokasi,
                ]);
            }else{
                // if show is 'Transaksi'
                // getting data from tb_produk_history
                $data = tb_produk_history::on($this->connection())->with('produk')->where('kode_produk', $this->kode_produk)->whereBetween('tanggal_transaksi', [$this->tanggal_awal, $this->tanggal_akhir])->where('kode_lokasi', auth()->user()->kode_lokasi)->orderBy('created_at', 'asc')->get();