privacy/app/Http/Controllers/CatatanpoController.php

    public function index()
    {
        $konek = self::konek();
        $create_url = route('catatanpo.create');

        $tgl_jalan = tb_akhir_bulan::on($konek)->where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();
---
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1