privacy/app/Http/Controllers/EndofmonthController.php

    public function index()
    {
        $konek = self::konek();
        $create_url = route('endofmonth.create');
        $tanggal = tb_akhir_bulan::on($konek)->where('status_periode','Open')->pluck('periode','periode');

        $tgl_jalan = tb_akhir_bulan::on($konek)->where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
---
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1