privacy/app/Http/Controllers/Kasbon1Controller.php

select `nama_lokasi` from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
---
    public function index()
    {
        // getting nama lokasi from MasterLokasi
        $nama_lokasi = MasterLokasi::select('nama_lokasi')->where('kode_lokasi', auth()->user()->kode_lokasi)->first()->nama_lokasi;