privacy/app/Http/Controllers/KasbonController.php

select `nama_company`, `kode_company` from `company`
select `nama_lokasi`, `kode_lokasi` from `master_lokasi` where `kode_lokasi` <> 'HO'
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1
---
    public function index()
    {
        $konek = self::konek();
        $Company= Company::pluck('nama_company','kode_company');
        $Lokasi= MasterLokasi::where('kode_lokasi', '<>', auth()->user()->kode_lokasi)->pluck('nama_lokasi','kode_lokasi');
        $asal = MasterLokasi::where('kode_lokasi', auth()->user()->kode_lokasi)->first();

        $tgl_jalan = tb_akhir_bulan::on($konek)->where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();

select * from `master_lokasi` where `master_lokasi`.`kode_lokasi` = 'HO' limit 1
select * from `company` where `company`.`kode_company` = '02' limit 1
---
    public function exportPDF(){
        $konek = self::konek();
        $request = $_GET['no_pkb'];

        $kasbon = Kasbon::on($konek)->find($request);
        $user = $kasbon->created_by;

        $tgl = $kasbon->tanggal_permintaan;
        $date=date_create($tgl);

        $total_qty = $kasbon->nilai;
        $ttd = $user;

        $get_lokasi = auth()->user()->kode_lokasi;
        $get_company = auth()->user()->kode_company;

        $nama_lokasi = MasterLokasi::find($get_lokasi);
        $nama = $nama_lokasi->nama_lokasi;

        $company = Company::find($get_company);