privacy/app/Http/Controllers/KonversiController.php

select * from `produk` where `produk`.`id` = '1045' limit 1
---
    public function edit_konversi()
    {
        $konek = self::konek();
        $kode_konversi = request()->id;
        $data = Konversi::on($konek)->find($kode_konversi);
        $get_produk = Produk::on($konek)->find($data->kode_produk);