privacy/app/Http/Controllers/MasterLokasiController.php

    public function index()
    {
        $konek = self::konek();
        $create_url = route('masterlokasi.create');

        $tgl_jalan = tb_akhir_bulan::on($konek)->where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();
---
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1

    public function store(Request $request)
    {
        $nama_lokasi = $request->nama_lokasi;
        $ceklokasi = MasterLokasi::where('nama_lokasi',$nama_lokasi)->first();
---
select * from `master_lokasi` where `nama_lokasi` = '123' limit 1

    public function edit_lokasi()
    {
        $kode_lokasi = request()->id;
        $data = MasterLokasi::find($kode_lokasi);
---
select * from `master_lokasi` where `master_lokasi`.`kode_lokasi` = 'EKO' limit 1