privacy/app/Http/Controllers/Produk1Controller.php

select * from `company` where `company`.`kode_company` = '02' limit 1
---
    public function exportexcel(){
        // getting company name from Company table
        $get_nama_company = Company::find(auth()->user()->kode_company)->nama_company;

select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `produk` where `produk`.`id` = '463' limit 1
select `nama_kategori`, `kode_kategori` from `kategori_produk`
select `nama_unit`, `kode_unit` from `unit`
select `nama_merek`, `kode_merek` from `merek`
select `nama_ukuran`, `kode_ukuran` from `ukuran`
select `nama_satuan`, `kode_satuan` from `satuan`
---
    public function showDetail($id){
        // getting nama lokasi from MasterLokasi table
        $nama_lokasi = MasterLokasi::where('kode_lokasi', auth()->user()->kode_lokasi)->first()->nama_lokasi;

        // getting period
        $period = $this->getPeriode();

        // getting the produk using id with eager loading
        $produk = Produk::on($this->connection())->with('kategoriproduk', 'merek', 'satuan', 'company', 'ukuran')->find($id);

        // getting detail of the product from tb_item_bulanan
        $detail = tb_item_bulanan::on($this->connection())->where('kode_produk', $id)->where('kode_lokasi', auth()->user()->kode_lokasi)->where('periode', $period)->first();

        // cek ending stock
        $ending_stock = $detail->ending_stock;

        // getting produk category from KategoriProduk table make it array
        $kategori = KategoriProduk::pluck('nama_kategori', 'kode_kategori');

        // getting unit with its kode from Unit table
        $unit = Unit::pluck('nama_unit', 'kode_unit');

        // getting merek code with its name from Merek table
        $merek = Merek::on($this->connection())->pluck('nama_merek', 'kode_merek');

        // getting ukuran from table Ukuran
        $ukuran = Ukuran::on($this->connection())->pluck('nama_ukuran', 'kode_ukuran');

        // getting satuan with its code from satuan table
        $satuan = satuan::pluck('nama_satuan', 'kode_satuan');

select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select `nama_kategori`, `kode_kategori` from `kategori_produk`
select `nama_unit`, `kode_unit` from `unit`
select `nama_merek`, `kode_merek` from `merek`
select `nama_satuan`, `kode_satuan` from `satuan`
select `nama_ukuran`, `kode_ukuran` from `ukuran`
select `nama_produk`, `id` from `produk`
---
    public function index()
    {
        // getting nama lokasi from MasterLokasi table
        $nama_lokasi = MasterLokasi::where('kode_lokasi', auth()->user()->kode_lokasi)->first()->nama_lokasi;

        // getting period from tb_akhir_bulan table and parse it using Carbon
        $period = tb_akhir_bulan::on($this->connection())
            ->where('reopen_status', 'true')
            ->orWhere('status_periode', 'Open')
            ->first()->periode;

        $period = Carbon::parse($period)->format('F Y');

        // user level
        $level = auth()->user()->level;

        // getting produk category from KategoriProduk table make it array
        $kategori = KategoriProduk::pluck('nama_kategori', 'kode_kategori');

        // getting unit with its kode from Unit table
        $unit = Unit::pluck('nama_unit', 'kode_unit');

        // getting merek code with its name from Merek table
        $merek = Merek::on($this->connection())->pluck('nama_merek', 'kode_merek');

        // getting satuan with its code from satuan table
        $satuan = satuan::pluck('nama_satuan', 'kode_satuan');

        // getting ukuran from table Ukuran
        $ukuran = Ukuran::on($this->connection())->pluck('nama_ukuran', 'kode_ukuran');

        // getting all produk from Produk table
        $produk = Produk::on($this->connection())->pluck('nama_produk', 'id')->sort();

select * from `produk` where `produk`.`id` = '547' limit 1
---
    public function show($idProduk)
    {
        // getting the produk using idProduk with eager loading
        $produk = Produk::on($this->connection())->with('kategoriproduk', 'merek', 'satuan', 'company', 'ukuran')->find($idProduk);

select * from `produk` where `produk`.`id` = '1997' limit 1
---
    public function edit($idProduk)
    {
        //
        return response()->json(Produk::on($this->connection())->find($idProduk));

select `nama_produk` from `produk` where `produk`.`id` = '275' limit 1
select `nama_company` from `company` where `company`.`kode_company` = '02' limit 1
---
    public function exportPDF(Request $request){
        // getting nama produk from Produk table
        $get_nama_produk = Produk::on($this->connection())->select('nama_produk')->find($request->kode_produk_detail)->nama_produk;

        // getting nama company from Company table
        $get_nama_company = Company::select('nama_company')->find(auth()->user()->kode_company)->nama_company;

select `nama_lokasi` from `master_lokasi` where `master_lokasi`.`kode_lokasi` = 'HO' limit 1
---
            // check if kode_lokasi_detail is not 'SEMUA'
            if($request->kode_lokasi_detail != 'SEMUA'){
                // getting nama lokasi from MasterLokasi
                $nama_lokasi = MasterLokasi::select('nama_lokasi')->find(auth()->user()->kode_lokasi)->nama_lokasi;