privacy/app/Http/Controllers/ProdukController.php

select * from `produk` where `produk`.`id` = '551' limit 1
---
    public function show_produk()
    {
        $konek = self::konek();
        $kode_produk = request()->id;
        $data = Produk::on($konek)->with('kategoriproduk','merek','satuan','company','ukuran')->find($kode_produk);