privacy/app/Http/Controllers/SetupaksesController.php

    public function index()
    {
        $konek = self::konek();
        $create_url = route('setupakses.create');

        $tgl_jalan = tb_akhir_bulan::on($konek)->where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');

        $User = Users::where('kode_company', auth()->user()->kode_company)->pluck('name','name');

        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();
---
select `name`, `name` from `users` where `kode_company` = '02'
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1

    public function anyData()
    {
        $konek = self::konek();
        return Datatables::of(SetupAkses::on($konek)->get())->make(true);
---
select * from `setup_akses`

    public function edit_bank()
    {
        $konek = self::konek();
        $kode_bank = request()->id;
        $data = SetupAkses::on($konek)->find($kode_bank);
---
select * from `setup_akses` where `setup_akses`.`id` = '5' limit 1