privacy/app/Http/Controllers/SignatureController.php

    public function index()
    {
        $konek = self::konek();
        $create_url = route('signature.create');

        $tgl_jalan = tb_akhir_bulan::on($konek)->where('reopen_status','true')->orwhere('status_periode','Open')->first();
        $tgl_jalan2 = $tgl_jalan->periode;
        $period = Carbon\Carbon::parse($tgl_jalan2)->format('F Y');
        $Lokasi= MasterLokasi::pluck('nama_lokasi','kode_lokasi');
        $get_lokasi = MasterLokasi::where('kode_lokasi',auth()->user()->kode_lokasi)->first();
        $nama_lokasi = $get_lokasi->nama_lokasi;

        $get_company = Company::where('kode_company',auth()->user()->kode_company)->first();
---
select `nama_lokasi`, `kode_lokasi` from `master_lokasi`
select * from `master_lokasi` where `kode_lokasi` = 'HO' limit 1
select * from `company` where `kode_company` = '02' limit 1

    public function edit_signature()
    {
        $konek = self::konek();
        $kode_signature = request()->id;
        $data = Signature::on($konek)->find($kode_signature);
---
select * from `signature` where `signature`.`kode_signature` = '007' limit 1