privacy/app/Http/Controllers/TaxSetupController.php

select * from `tax_setups` where `tax_setups`.`id_pajak` = '003' limit 1
update `tax_setups` set `nama_pajak` = 'PAJAK EKO S', `updated_at` = '2022-10-29 13:17:18' where `id_pajak` = '003'
---
    public function updateAjax(Request $request)
    {
        TaxSetup::find($request->id_pajak)->update($request->all());