privacy/app/Http/Controllers/TransaksisetupController.php

    public function edit_transaksisetup()
    {
        $kode_setup = request()->id;
        $data = TransaksiSetup::find($kode_setup);
---
select * from `transaksi_setups` where `transaksi_setups`.`kode_setup` = '007' limit 1